import React from "react";
import coding from "../../assets/icons/coding.png";
import flow from "../../assets/icons/flow-diagram.png";
import internet from "../../assets/icons/internet.png";
import software from "../../assets/icons/software-development.png";

import Card from "./card";

export default function Container(props) {
  const data = [
    {
      name: "خدمات برنامه نویسی",
      title:
        "انجام پروژه های دانشجویی برنامه نویسی به زبان های رایجی که در دانشگاه ها تدریس می شود ",
      src: coding,
    },
    {
      name: "طراحی وب سایت ",
      title:
        "طراحی و توسعه انواع وب سایت های فروشگاهی ، شخصی ، رزومه ، خبری و ... با عقد قرارداد رسمی",
      src: internet,
    },
    {
      name: "پروژه های مهندسی نرم افزار",
      title:
        "انجام انواع پروژه های دانشجویی رشته مهندسی نرم افزار در اکثر دروس تخصصی و همچنین کمک در انجام این قبیل پروژه ها ",
      src: software,
    },
    {
      name: "رسم دیاگرام ",
      title:
        "یکی از مشکلات دانشجویات در این زمینه است . کلیه خدمات مربوط به رسم دیاگرام ، تحلیل نیازمندی ها و ... انجام می شود ",
      src: flow,
    },
  ];
  return (
    <div class="flex flex-col w-full mt-5 py-32 px-5">
      <div class="grid h-20 card bg-none rounded-box place-items-center">
        <h1 className=" bg-none text-2xl font-bold welcome-txt-name rounded">
          خدمات برنامه نویسی دانشجویی و طراحی وب سایت
        </h1>
        <h1 className=" bg-none text-sm font-bold text-white  tracking-wide rounded">
          شما می توانید خدمت مورد نظر را از راه های ارتباطی زیر به ما بسپارید
        </h1>
      </div>
      <div className="mt-6 pb-16 lg:pb-0 w-4/5 lg:w-full mx-auto flex space-x-10 flex-wrap items-center justify-center">
        <a
          className="link"
          href="t.me/mohsen_rahmii"
          data-tippy-content="@telegram_handle"
        >
          <svg
            className="h-9 mt-3 fill-current text-gray-600 hover:text-green-700"
            role="img"
            viewBox="0 0 24 24"
            xmlns="http://www.w3.org/2000/svg"
          >
            <title>Telegram</title>
            <path d="M16 8A8 8 0 1 1 0 8a8 8 0 0 1 16 0zM8.287 5.906c-.778.324-2.334.994-4.666 2.01-.378.15-.577.298-.595.442-.03.243.275.339.69.47l.175.055c.408.133.958.288 1.243.294.26.006.549-.1.868-.32 2.179-1.471 3.304-2.214 3.374-2.23.05-.012.12-.026.166.016.047.041.042.12.037.141-.03.129-1.227 1.241-1.846 1.817-.193.18-.33.307-.358.336a8.154 8.154 0 0 1-.188.186c-.38.366-.664.64.015 1.088.327.216.589.393.85.571.284.194.568.387.936.629.093.06.183.125.27.187.331.236.63.448.997.414.214-.02.435-.22.547-.82.265-1.417.786-4.486.906-5.751a1.426 1.426 0 0 0-.013-.315.337.337 0 0 0-.114-.217.526.526 0 0 0-.31-.093c-.3.005-.763.166-2.984 1.09z" />
          </svg>
        </a>
        <a
          className="link"
          href="https://www.instagram.com/mohsen_rahmii"
          data-tippy-content="@instagram_handle"
        >
          <svg
            className="h-6 fill-current text-gray-600 hover:text-green-700"
            role="img"
            viewBox="0 0 24 24"
            xmlns="http://www.w3.org/2000/svg"
          >
            <title>Instagram</title>
            <path d="M12 0C8.74 0 8.333.015 7.053.072 5.775.132 4.905.333 4.14.63c-.789.306-1.459.717-2.126 1.384S.935 3.35.63 4.14C.333 4.905.131 5.775.072 7.053.012 8.333 0 8.74 0 12s.015 3.667.072 4.947c.06 1.277.261 2.148.558 2.913.306.788.717 1.459 1.384 2.126.667.666 1.336 1.079 2.126 1.384.766.296 1.636.499 2.913.558C8.333 23.988 8.74 24 12 24s3.667-.015 4.947-.072c1.277-.06 2.148-.262 2.913-.558.788-.306 1.459-.718 2.126-1.384.666-.667 1.079-1.335 1.384-2.126.296-.765.499-1.636.558-2.913.06-1.28.072-1.687.072-4.947s-.015-3.667-.072-4.947c-.06-1.277-.262-2.149-.558-2.913-.306-.789-.718-1.459-1.384-2.126C21.319 1.347 20.651.935 19.86.63c-.765-.297-1.636-.499-2.913-.558C15.667.012 15.26 0 12 0zm0 2.16c3.203 0 3.585.016 4.85.071 1.17.055 1.805.249 2.227.415.562.217.96.477 1.382.896.419.42.679.819.896 1.381.164.422.36 1.057.413 2.227.057 1.266.07 1.646.07 4.85s-.015 3.585-.074 4.85c-.061 1.17-.256 1.805-.421 2.227-.224.562-.479.96-.899 1.382-.419.419-.824.679-1.38.896-.42.164-1.065.36-2.235.413-1.274.057-1.649.07-4.859.07-3.211 0-3.586-.015-4.859-.074-1.171-.061-1.816-.256-2.236-.421-.569-.224-.96-.479-1.379-.899-.421-.419-.69-.824-.9-1.38-.165-.42-.359-1.065-.42-2.235-.045-1.26-.061-1.649-.061-4.844 0-3.196.016-3.586.061-4.861.061-1.17.255-1.814.42-2.234.21-.57.479-.96.9-1.381.419-.419.81-.689 1.379-.898.42-.166 1.051-.361 2.221-.421 1.275-.045 1.65-.06 4.859-.06l.045.03zm0 3.678c-3.405 0-6.162 2.76-6.162 6.162 0 3.405 2.76 6.162 6.162 6.162 3.405 0 6.162-2.76 6.162-6.162 0-3.405-2.76-6.162-6.162-6.162zM12 16c-2.21 0-4-1.79-4-4s1.79-4 4-4 4 1.79 4 4-1.79 4-4 4zm7.846-10.405c0 .795-.646 1.44-1.44 1.44-.795 0-1.44-.646-1.44-1.44 0-.794.646-1.439 1.44-1.439.793-.001 1.44.645 1.44 1.439z" />
          </svg>
        </a>
        <a
          className="link"
          href="https://wa.me/0989337039971?text=(test text)"
          data-tippy-content="@youtube_handle"
        >
          <svg
            className="h-9 mt-3 fill-current text-gray-600 hover:text-green-700"
            role="img"
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 24 24"
          >
            <title>whats App</title>
            <path d="M13.601 2.326A7.854 7.854 0 0 0 7.994 0C3.627 0 .068 3.558.064 7.926c0 1.399.366 2.76 1.057 3.965L0 16l4.204-1.102a7.933 7.933 0 0 0 3.79.965h.004c4.368 0 7.926-3.558 7.93-7.93A7.898 7.898 0 0 0 13.6 2.326zM7.994 14.521a6.573 6.573 0 0 1-3.356-.92l-.24-.144-2.494.654.666-2.433-.156-.251a6.56 6.56 0 0 1-1.007-3.505c0-3.626 2.957-6.584 6.591-6.584a6.56 6.56 0 0 1 4.66 1.931 6.557 6.557 0 0 1 1.928 4.66c-.004 3.639-2.961 6.592-6.592 6.592zm3.615-4.934c-.197-.099-1.17-.578-1.353-.646-.182-.065-.315-.099-.445.099-.133.197-.513.646-.627.775-.114.133-.232.148-.43.05-.197-.1-.836-.308-1.592-.985-.59-.525-.985-1.175-1.103-1.372-.114-.198-.011-.304.088-.403.087-.088.197-.232.296-.346.1-.114.133-.198.198-.33.065-.134.034-.248-.015-.347-.05-.099-.445-1.076-.612-1.47-.16-.389-.323-.335-.445-.34-.114-.007-.247-.007-.38-.007a.729.729 0 0 0-.529.247c-.182.198-.691.677-.691 1.654 0 .977.71 1.916.81 2.049.098.133 1.394 2.132 3.383 2.992.47.205.84.326 1.129.418.475.152.904.129 1.246.08.38-.058 1.171-.48 1.338-.943.164-.464.164-.86.114-.943-.049-.084-.182-.133-.38-.232z" />
          </svg>
        </a>
      </div>
      <div class="divider"></div>
      <div class=" card ml-auto mr-auto rounded-box flex  lg:flex-row justify-center">
        {data.map((v, i) => {
          return <Card name={v.name} title={v.title} src={v.src} />;
        })}
      </div>
    </div>
  );
}
